/********************************************************************************************/
/* Montage Technology (Shanghai) Co., Ltd.                                                  */
/* Montage Proprietary and Confidential                                                     */
/* Copyright (c) 2014 Montage Technology Group Limited and its affiliated companies         */
/********************************************************************************************/
#include "sys_types.h"
#include "sys_define.h"

#include "string.h"
#include "stdlib.h"

#include "mtos_printk.h"
#include "lib_search.h"

#include "iso_639_2.h"
#include "err_check_def.h"

typedef struct
{
  u8 desc[ISO_639_2_DESC_LENGTH];
  u16 index;
}iso_639_2_desc_t;

static iso_639_2_desc_t iso_639_2_desc[] =
{
  { { 'u', 'd',  'f'}, 0   }, /* Undefined and don't remove this line */
//{ { 'a', 'a', 'r' }, 1   }, /* Afar  °¢·¨¶ûÓï¡¢°¢·¨Óï */
//{ { 'a', 'b', 'k' }, 2   }, /* Abkhazian  °¢²¼¹þ×ÈÓï */
//{ { 'a', 'c', 'e' }, 3   }, /* Achinese  ÑÇÆëÓï */
//{ { 'a', 'c', 'h' }, 4   }, /* Acoli  °¢ÇÇÀûÓï */
//{ { 'a', 'd', 'a' }, 5   }, /* Adangme  °¢µ±Ã·Óï */
//{ { 'a', 'd', 'y' }, 6   }, /* Adyghe  °¢µÏ¸ñÓï */
//{ { 'a', 'f', 'a' }, 7   }, /* Afro-Asiatic (Other)  ÑÇ·ÇÓïÏµ¡¢ÉÁº¬ÓïÏµ*/
//{ { 'a', 'f', 'h' }, 8   }, /* Afrihili  °¢¸¥ÀïÏ£ÀûÓï */
//{ { 'a', 'f', 'r' }, 9   }, /* Afrikaans  °¢·ÇÀû¿°Ë¹Óï¡¢ÄÏ·ÇºÉÀ¼Óï¡¢ÄÏ*/
//{ { 'a', 'i', 'n' }, 10  }, /* Ainu (Japan)  °¢ÒÁÅ¬Óï */
//{ { 'a', 'k', 'a' }, 11  },  /* Akan  °¢¿²Óï */
//{ { 'a', 'k', 'k' }, 12  },  /* Akkadian  °¢¿¨µÂÓï */
//{ { 'a', 'l', 'b' }, 13  },  /* Albanian  °¢¶û°ÍÄáÑÇÓï */
//{ { 'a', 'l', 'e' }, 14  },  /* Aleut  °¢ÁôÉêÓï */     
//{ { 'a', 'l', 'g' }, 15  },  /* Algonquian languages  °¢¶û¸ÔÀ¥ÖîÓïÑÔ*/
//{ { 'a', 'l', 't' }, 16  },  /* Southern Altai  ÄÏ°¢¶ûÌ©Óï */         
//{ { 'a', 'm', 'h' }, 17  },  /* Amharic  °¢Ä·¹þÀ­Óï */               
//{ { 'a', 'n', 'g' }, 18  },  /* Old English (ca. 450-1100)  ¹ÅÓ¢Óï */ 
//{ { 'a', 'n', 'p' }, 19  },  /* Angika  °²¼ª¿¨Óï */                   
//{ { 'a', 'p', 'a' }, 20  },  /* Apache languages  °¢ÅÁÇÐÓïÖ§ */       
  { { 'a', 'r', 'a' }, 21  },  /* Arabic  °¢À­²®Óï */                   
//{ { 'a', 'r', 'c' }, 22  },  /* Official Aramaic (700-300 BCE)  °¢À­*/
//{ { 'a', 'r', 'g' }, 23  },  /* Aragonese  °¢À­¹±Óï */
//{ { 'a', 'r', 'm' }, 24  },  /* Armenian  ÑÇÃÀÄáÑÇÓï*/
//{ { 'a', 'r', 'n' }, 25  },  /* Mapudungun  °¢ÀÍ¿²Óï */
//{ { 'a', 'r', 'p' }, 26  },  /* Arapaho  °¢À­ÅÁ»ôÓï */
//{ { 'a', 'r', 't' }, 27  },  /* Artificial (Other)  ÈË¹¤ÓïÑÔ */
//{ { 'a', 'r', 'w' }, 28  },  /* Arawak  °¢À­Íß¿ËÓï */
//{ { 'a', 's', 'm' }, 29  },  /* Assamese  °¢ÈøÄ·Óï */
//{ { 'a', 's', 't' }, 30  },  /* Asturian  °¢Ë¹Í¼ÀïÑÇË¹Óï */
//{ { 'a', 't', 'h' }, 31  },  /* Athapascan languages  °¢ÈøÅÁË¹¿²Óï×å*/
//{ { 'a', 'u', 's' }, 32  },  /* Australian languages  °Ä´óÀûÑÇÓïÏµ */    
//{ { 'a', 'v', 'a' }, 33  },  /* Avaric  °¢Íß¶ûÓï */                      
//{ { 'a', 'v', 'e' }, 34  },  /* Avestan  °¢Î¬Ë¹ÍÓÓï¡¢°¢Ë¹Î¬ÌØÓï */      
//{ { 'a', 'w', 'a' }, 35  },  /* Awadhi  °¢ÍßµÂÓï */                      
//{ { 'a', 'y', 'm' }, 36  },  /* Aymara  °¬ÂíÀ­Óï */                      
  { { 'a', 'z', 'e' }, 37  },  /* Azerbaijani  °¢Èû°Ý½®Óï¡¢°¢Èû°Ý½®Óï*/   
//{ { 'b', 'a', 'd' }, 38  },  /* Banda languages  °à´ïÓï */
//{ { 'b', 'a', 'i' }, 39  },  /* Bamileke languages  °ÍÃ×ÀÛ¿ËÓïÖ§ */
//{ { 'b', 'a', 'k' }, 40  },  /* Bashkir  °ÍÊ²»ù¶ûÓï¡¢°ÍÊ²¸Á¶ûÓï */
//{ { 'b', 'a', 'l' }, 41  },  /* Baluchi  ÙÂÂ·Ö§Óï */              
//{ { 'b', 'a', 'm' }, 42  },  /* Bambara  °à°ÍÀ­Óï */              
//{ { 'b', 'a', 'n' }, 43  },  /* Balinese  QÀïÓï */                
//{ { 'b', 'a', 'q' }, 44  },  /* Basque  °ÍË¹¿ËÓï */                
//{ { 'b', 'a', 's' }, 45  },  /* Basa (Cameroon)  °ÍÈøÓï */        
//{ { 'b', 'a', 't' }, 46  },  /* Baltic (Other)  ²¨ÂÞµÄÓï×å */      
//{ { 'b', 'e', 'j' }, 47  },  /* Beja  ±´¼ÖÓï */                    
  { { 'b', 'e', 'l' }, 48  },  /* Belarusian  °×¶íÂÞË¹Óï */          
//{ { 'b', 'e', 'm' }, 49  },  /* Bemba (Zambia)  ±¾°ÍÓï */          
  { { 'b', 'e', 'n' }, 50  },  /* Bengali  ÃÏ¼ÓÀ­Óï */              
//{ { 'b', 'e', 'r' }, 51  },  /* Berber (Other)  °Ø°Ø¶ûÓï×å */      
//{ { 'b', 'h', 'o' }, 52  },  /* Bhojpuri  ²©½ÜÆÕ¶ûÓï */            
//{ { 'b', 'i', 'h' }, 53  },  /* Bihari  ±È¹þ¶ûÓï */                      
//{ { 'b', 'i', 'k' }, 54  },  /* Bikol  ±È¿Æ¶ûÓï */                      
//{ { 'b', 'i', 'n' }, 55  },  /* Bini  ±ÈÄáÓï */                          
//{ { 'b', 'i', 's' }, 56  },  /* Bislama  ±ÈË¹À­ÂíÓï¡¢±ÈË¹­ÂêÓ?*/      
//{ { 'b', 'l', 'a' }, 57  },  /* Siksika  Î÷¿ËÎ÷¿¨Óï */                  
//{ { 'b', 'n', 't' }, 58  },  /* Bantu (Other)  °àÍ¼ÓïÖ§ */              
  { { 'b', 'o', 'd' }, 59  },  /* Tibetan  ²ØÓï */                        
//{ { 'b', 'o', 's' }, 60  },  /* Bosnian  ²¨Ë¹ÄáÑÇÓï¡¢²¨Ë¹ÄáÑÇÓï */      
//{ { 'b', 'r', 'a' }, 61  },  /* Braj  ²¼À­¼ªÓï */                        
//{ { 'b', 'r', 'e' }, 62  },  /* Breton  ²¼ÁÐËþÄáÓï¡¢²¼Àï¶àÄáÓï */        
//{ { 'b', 't', 'k' }, 63  },  /* Batak languages  °ÍËþËÓ?*/            
//{ { 'b', 'u', 'a' }, 64  },  /* Buriat  ²¼ÀïÑÇÌØÓï */                    
//{ { 'b', 'u', 'g' }, 65  },  /* Buginese  ²¼¼ªÓï */                      
  { { 'b', 'u', 'l' }, 66  },  /* Bulgarian  ±£¼ÓÀûÑÇÓï */                
  { { 'b', 'u', 'r' }, 67  },  /* Burmese  ÃåµéÓï */                      
//{ { 'b', 'y', 'n' }, 68  },  /* Bilin  ±ÈÁÖÓï */                        
//{ { 'c', 'a', 'd' }, 69  },  /* Caddo  ¿¨¶àÓï */                        
//{ { 'c', 'a', 'i' }, 70  },  /* Central American Indian (Other)  ÖÐ*/
//{ { 'c', 'a', 'r' }, 71  },  /* Galibi Carib  ¼ÓÀÕ±ÈÓïÏµ */          
//{ { 'c', 'a', 't' }, 72  },  /* Catalan  ¼ÓÌ©Â¡ÄáÑÇÓï¡¢¼ÓÌ©ÂÞÄáÑÇÓï*/
//{ { 'c', 'a', 'u' }, 73  },  /* Caucasian (Other)  ¸ß¼ÓË÷ÓïÏµ*/
//{ { 'c', 'e', 'b' }, 74  },  /* Cebuano  ËÞÎñÓï¡¢ËÞÎíÓï */              
//{ { 'c', 'e', 'l' }, 75  },  /* Celtic (Other)  ¿­¶ûÌØÓï×å¡¢Èû¶ûÌØÓï*/
  { { 'c', 'e', 's' }, 76  },  /* Czech  ½Ý¿ËÓï */
//{ { 'c', 'h', 'a' }, 77  },  /* Chamorro  ²éÄªÂÞÓï */                    
//{ { 'c', 'h', 'b' }, 78  },  /* Chibcha   Ææ²¼²éÓï*/                    
//{ { 'c', 'h', 'e' }, 79  },  /* Chechen   ³µ³¼Óï */
//{ { 'c', 'h', 'g' }, 80  },  /* Chagatai  ²é¼ÓÌ¨Óï¡¢²é¼ÓÌ©Óï¡¢²ìºÏÌ¨*/
  { { 'c', 'h', 'i' }, 81  },  /* Chinese  ÖÐÎÄ¡¢ººÓï */              
//{ { 'c', 'h', 'k' }, 82  },  /* Chuukese  Çð¿ËÓï */                      
//{ { 'c', 'h', 'm' }, 83  },  /* Mari (Russia)  ÂíÀïÓï */                
//{ { 'c', 'h', 'n' }, 84  },  /* Chinook jargon  ÆæÅ¬¿Ë»ìºÏÓï */          
//{ { 'c', 'h', 'o' }, 85  },  /* Choctaw  ÇÇ¿ËÍÐÓï */
//{ { 'c', 'h', 'p' }, 86  },  /* Chipewyan  ÆæÅåÎ¬°²Óï */                
//{ { 'c', 'h', 'r' }, 87  },  /* Cherokee  ÇÐÂÞ»ùÓï */                    
//{ { 'c', 'h', 'u' }, 88  },  /* Church Slavic  ¹Å½Ì»áË¹À­·òÓï */        
//{ { 'c', 'h', 'v' }, 89  },  /* Chuvash  ³þÍßÊ²Óï */                    
//{ { 'c', 'h', 'y' }, 90  },  /* Cheyenne  ÏÄÑÓÓï */                      
//{ { 'c', 'm', 'c' }, 91  },  /* Chamic languages  Õ¼ÓïÖîÓïÑÔ */          
//{ { 'c', 'o', 'p' }, 92  },  /* Coptic  ¿ÆÆÕÌØÓï */                      
//{ { 'c', 'o', 'r' }, 93  },  /* Cornish  ¿µÎÖ¶ûï¡¡¢¿µÍß¶ûÓï */          
//{ { 'c', 'o', 's' }, 94  },  /* Corsican  ¿ÆÎ÷¼ÎÓï */                    
//{ { 'c', 'p', 'e' }, 95  },  /* Creoles and pidgins                     
//{ { 'c', 'p', 'f' }, 96  },  /* Creoles and pidgins                     
//{ { 'c', 'p', 'p' }, 97  },  /* Creoles and pidgins                     
//{ { 'c', 'r', 'e' }, 98  },  /* Cree  ¿ËÀïÓï */                          
//{ { 'c', 'r', 'h' }, 99  },  /* Crimean Tatar  ¿ËÀïÃ×ÑÇ÷²÷°Óï */        
//{ { 'c', 'r', 'p' }, 100 },  /* Creoles and pidgins (Other)  ¿ËÀï°Â*/
//{ { 'c', 's', 'b' }, 101 }, /* Kashubian  ¿¨Êæ±ÈÓï */                
//{ { 'c', 'u', 's' }, 102 }, /* Cushitic (Other)  ¿âÏ£ÌØÓï×å */          
  { { 'c', 'y', 'm' }, 103 }, /* Welsh  Íþ¶ûÊ¿Óï¡¢Íþ¶ûÊ¿Óï */              
  { { 'c', 'z', 'e' }, 76  },  /* Czech  ½Ý¿ËÓï */                        
//{ { 'd', 'a', 'k' }, 104 }, /* Dakota  ´ï¿ÆËûÓï */                      
  { { 'd', 'a', 'n' }, 105 }, /* Danish  µ¤ÂóÓï */ 
//{ { 'd', 'a', 'r' }, 106 }, /* Dargwa  ´ï¶û¸ñÍßÓï */                    
//{ { 'd', 'a', 'y' }, 107 }, /* Land Dayak languages  ´ïÑÅ¿ËÓï */        
//{ { 'd', 'e', 'l' }, 108 }, /* Delaware  ÌØÀ­»ªÓï */                    
//{ { 'd', 'e', 'n' }, 109 }, /* Slave (Athapascan)  Ê·À­Î¬Óï */          
  { { 'd', 'e', 'u' }, 110 }, /* German  µÂÓï */                          
//{ { 'd', 'g', 'r' }, 111 }, /* Dogrib  ¶à¸ñÀï²¼Óï */                    
//{ { 'd', 'i', 'n' }, 112 }, /* Dinka  ¶¡¿¨Óï */                          
//{ { 'd', 'i', 'v' }, 113 }, /* Dhivehi  µÏÎ¬Ï£Óï */                      
//{ { 'd', 'o', 'i' }, 114 }, /* Dogri (macrolanguage)  ¶à¸ñÀ­Óï */        
//{ { 'd', 'r', 'a' }, 115 }, /* Dravidian (Other)  ´ïÂÞÅþÝ±ÖîÓïÑÔ */      
//{ { 'd', 's', 'b' }, 116 }, /* Lower Sorbian  ÏÂË÷²¼Óï */                
//{ { 'd', 'u', 'a' }, 117 }, /* Duala  ¶ÅÑÇÀ­Óï */                        
  { { 'd', 'u', 'm' }, 118 }, /* Middle Dutch (ca. 1050-1350)  ÖÐ¹ÅºÉ*/   
  { { 'd', 'u', 't' }, 119 }, /* Dutch  ºÉÀ¼Óï */                          
//{ { 'd', 'y', 'u' }, 120 },   /* Dyula  µÏÓÈÀ­Óï */                      
//{ { 'd', 'z', 'o' }, 121 }, /* Dzongkha  ×Ú¿¦Óï¡¢²»µ¤Óï */              
//{ { 'e', 'f', 'i' }, 122 }, /* Efik  °£·Æ¿ËÓï */                        
//{ { 'e', 'g', 'y' }, 123 }, /* Egyptian (Ancient)  ¹Å°£¼°Óï */          
//{ { 'e', 'k', 'a' }, 124 }, /* Ekajuk  °£¿ËÇð¿ËÓï */
  { { 'e', 'l', 'l' }, 125 }, /* Modern Greek (1453-)  ÏÖ´úÏ£À°Óï */      
  { { 'e', 'l', 'x' }, 126 }, /* Elamite  °£À¼Óï */                        
  { { 'e', 'n', 'g' }, 127 }, /* English  Ó¢Óï */                          
  { { 'e', 'n', 'm' }, 128 }, /* Middle English (1100-1500)  ÖÐ¹ÅÓ¢Óï*/   
//{ { 'e', 'p', 'o' }, 129 }, /* Esperanto  ÊÀ½çÓï */                      
  { { 'e', 's', 't' }, 130 }, /* Estonian  °®É³ÄáÑÇÓï */                  
//{ { 'e', 'u', 's' }, 44  },  /* Basque  °ÍË¹¿ËÓï */                      
//{ { 'e', 'w', 'e' }, 131 }, /* Ewe  °£Î¬Óï¡¢ÓÄÓï */                      
//{ { 'e', 'w', 'o' }, 132 }, /* Ewondo  °£ÎÌ¶àÓï */                      
//{ { 'f', 'a', 'n' }, 133 }, /* Fang (Equatorial Guinea)  ·¼Óï */
//{ { 'f', 'a', 'o' }, 134 }, /* Faroese  ·¨ÂÞË¹Óï¡¢·¨ÂÞÓï */              
  { { 'f', 'a', 's' }, 135 }, /* Persian  ²¨Ë¹Óï */                        
//{ { 'f', 'a', 't' }, 136 }, /* Fanti  ·¼µÙÓï */                          
//{ { 'f', 'i', 'j' }, 137 }, /* Fijian  ì³¼ÃÓï */                        
//{ { 'f', 'i', 'l' }, 138 }, /* Filipino  ·ÆÂÉ±öÓï */                    
  { { 'f', 'i', 'n' }, 139 }, /* Finnish  ·ÒÀ¼Óï */                        
//{ { 'f', 'i', 'u' }, 140 }, /* Finno-Ugrian (Other)  ·ÒÀ¼-ÎÚ¸ê¶ûÓï×å*/  
//{ { 'f', 'o', 'n' }, 141 }, /* Fon  ·áÓï */                              
  { { 'f', 'r', 'a' }, 142 }, /* French  ·¨Óï */                          
  { { 'f', 'r', 'e' }, 142 }, /* French  ·¨Óï */                          
//{ { 'f', 'r', 'm' }, 143 }, /* Middle French (ca. 1400-1600)  ÖÐ¹Å·¨*/   
//{ { 'f', 'r', 'o' }, 144 }, /* Old French (842-ca. 1400)  ¹Å·¨Óï */      
//{ { 'f', 'r', 'r' }, 145 }, /* Northern Frisian  ±±¸¥ÀïÎ÷ÑÇÓï */
//{ { 'f', 'r', 's' }, 146 }, /* Eastern Frisian  ¶«¸¥ÀïÎ÷ÑÇÓï */          
//{ { 'f', 'r', 'y' }, 147 }, /* Western Frisian  ¸¥ÀïÎ÷ÑÇÓï¡¢Î÷¸¥ÀïÎ÷*/   
//{ { 'f', 'u', 'l' }, 148 }, /* Fulah  ¸»À­Óï¡¢¸¥À­ÄáÓï */                
//{ { 'f', 'u', 'r' }, 149 }, /* Friulian  ¸¥ÁôÀûÓï */
//{ { 'g', 'a', 'a' }, 150 }, /* Ga  ¼ÓÓï */                              
//{ { 'g', 'a', 'y' }, 151 }, /* Gayo  ¿¨Ô¼Óï */                          
//{ { 'g', 'b', 'a' }, 152 }, /* Gbaya (Central African Republic)  °ÍÑÇ*/
  { { 'g', 'e', 'm' }, 153 }, /* Germanic (Other)  ÈÕ¶úÂüÓï×å¡¢ÈÕ¶ûÂü*/
  { { 'g', 'e', 'o' }, 154 }, /* Georgian  ¸ñÂ³¼ªÑÇÓï¡¢ÇÇÖÎÑÇÓï */        
  { { 'g', 'e', 'r' }, 110 }, /* German  µÂÓï */                          
//{ { 'g', 'e', 'z' }, 155 }, /* Geez  ¼ª×ÈÓï */                          
//{ { 'g', 'i', 'l' }, 156 }, /* Gilbertese  ¼ª¶û²®ÌØÓï */                
//{ { 'g', 'l', 'a' }, 157 }, /* Scottish Gaelic  ËÕ¸ñÀ¼¸Ç¶ûÓï */
  { { 'g', 'l', 'e' }, 158 }, /* Irish  °®¶ûÀ¼Óï */
//{ { 'g', 'l', 'g' }, 159 }, /* Galician  ¼ÓÀûÎ÷ÑÇÓï¡¢¼ÓÀïÎ÷ÑÇÓï */      
//{ { 'g', 'l', 'v' }, 160 }, /* Manx  Âí¶÷µºÓï¡¢Âí¶÷µºÓï */              
//{ { 'g', 'm', 'h' }, 161 }, /* Middle High German (ca. 1050-1500)  ÖÐ*/ 
//{ { 'g', 'o', 'h' }, 162 }, /* Old High German (ca. 750-1050)  ¹Å¸ß?/ 
//{ { 'g', 'o', 'n' }, 163 }, /* Gondi  ¹±µÂÓï */                          
//{ { 'g', 'o', 'r' }, 164 }, /* Gorontalo  ¸çÂ×´òÂåÓï */                  
//{ { 'g', 'o', 't' }, 165 }, /* Gothic  ¸çÌØÓï¡¢¸çµÂÓï */                
//{ { 'g', 'r', 'b' }, 166 }, /* Grebo  ¸ñÁÐ²©Óï */                        
  { { 'g', 'r', 'c' }, 167 }, /* Ancient Greek (to 1453)  ¹ÅµäÏ£À°Óï*/
  { { 'g', 'r', 'e' }, 125 }, /* Modern Greek (1453-)  ÏÖ´úÏ£À°Óï */
//{ { 'g', 'r', 'n' }, 168 }, /* Guarani  ¹ÏÀ­ÄáÓï */                      
//{ { 'g', 's', 'w' }, 169 }, /* Swiss German  ÈðÊ¿µÂÓï */                
//{ { 'g', 'u', 'j' }, 170 }, /* Gujarati  ¹Å¼ªÀ­ÌØÓï */                  
//{ { 'g', 'w', 'i' }, 171 }, /* Gwich?in  ¿â³¼Óï */                      
//{ { 'h', 'a', 'i' }, 172 }, /* Haida  º£´ïÓï */
//{ { 'h', 'a', 't' }, 173 }, /* Haitian  º£µØ¿ËÀï°Â¶ûÓï */                
//{ { 'h', 'a', 'u' }, 174 }, /* Hausa  ºÀÈøÓï¡¢ºÀÈöÓï */                  
//{ { 'h', 'a', 'w' }, 175 }, /* Hawaiian  ÏÄÍþÒÄÓï */                    
  { { 'h', 'e', 'b' }, 176 }, /* Hebrew  Ï£²®À´Óï */                      
//{ { 'h', 'e', 'r' }, 177 }, /* Herero  ºÕÀ×ÂÞÓï */                      
//{ { 'h', 'i', 'l' }, 178 }, /* Hiligaynon  Ï£Àû¸ÇÅ©Óï¡¢ÒÁÂ¡¸êÓï */      
//{ { 'h', 'i', 'm' }, 179 }, /* Himachali  Ï²ÂíÙÉ¶ûÓï */                  
//{ { 'h', 'i', 'n' }, 180 }, /* Hindi  Ó¡µØÓï */                          
//{ { 'h', 'i', 't' }, 181 }, /* Hittite  ºÕÌÝÓï */                        
//{ { 'h', 'm', 'n' }, 182 }, /* Hmong  ÃçÓï */                            
//{ { 'h', 'm', 'o' }, 183 }, /* Hiri Motu  Ï£ÀïÄªÍ¼Óï¡¢Ï£ÀïÄ¾ÍÐÓï */      
  { { 'h', 'r', 'v' }, 184 }, /* Croatian  ¿ËÂÞµØÑÇÓï¡¢¿ËÂÞµØÑÇÓï */      
//{ { 'h', 's', 'b' }, 185 }, /* Upper Sorbian  ÉÏË÷²¼Óï */                
  { { 'h', 'u', 'n' }, 186 }, /* Hungarian  ÐÙÑÀÀûÓï */                    
//{ { 'h', 'u', 'p' }, 187 }, /* Hupa  ºúÅÁÓï */                          
//{ { 'h', 'y', 'e' }, 24  },  /* Armenian  ÑÇÃÀÄáÑÇÓï */                  
//{ { 'i', 'b', 'a' }, 188 }, /* Iban  ÒÁ°àÓï */                          
//{ { 'i', 'b', 'o' }, 189 }, /* Igbo  ÒÁ²©Óï¡¢ÒÁ¸ñ°ØÓï*/                
  { { 'i', 'c', 'e' }, 190 }, /* Icelandic  ±ùµºÓï */                      
//{ { 'i', 'd', 'o' }, 191 }, /* Ido  ÒÁ¶àÓï */                            
//{ { 'i', 'i', 'i' }, 192 }, /* Sichuan Yi  ËÄ´¨ÒÍÓï */                  
//{ { 'i', 'j', 'o' }, 193 }, /* Ijo languages  ÒÁÇÇÓï */                  
//{ { 'i', 'k', 'u' }, 194 }, /* Inuktitut  ÒÁÅ¬ÒÁÌØÓï¡¢ÒÁÅ¬ÌØÓï¡¢ÒòÅ¦*/   
//{ { 'i', 'l', 'e' }, 195 }, /* Interlingue  Î÷·½¹ú¼ÊÓï£¨¹ú¼ÊÓïE£© */     
//{ { 'i', 'l', 'o' }, 196 }, /* Iloko  ÒÁÂå¿¨ÅµÓï */                      
//{ { 'i', 'n', 'a' }, 197 }, /* Interlingua  ¹ú¼ÊÓï£¨¹ú¼ÊÓïA£© */         
  { { 'i', 'n', 'c' }, 198 }, /* Indic (Other)  Ó¡¶È-ÑÅÀû°²ÓïÖ§ */         
  { { 'i', 'n', 'd' }, 199 }, /* Indonesian  Ó¡ÄáÓï¡¢Ó¡¶ÈÄáÎ÷ÑÇÓï */      
//{ { 'i', 'n', 'e' }, 200 }, /* Indo-European (Other)  Ó¡Å·ÓïÏµ */
//{ { 'i', 'n', 'h' }, 201 }, /* Ingush  Ó¡¹ÅÊ²Óï */                      
//{ { 'i', 'p', 'k' }, 202 }, /* Inupiaq  ÒÀÅ¬±Ó¿ËÓï¡¢ÒÁÅ¬±ØÓï */          
//{ { 'i', 'r', 'a' }, 203 }, /* Iranian (Other)  ÒÁÀÊÓïÖ§ */              
//{ { 'i', 'r', 'o' }, 204 }, /* Iroquoian languages  Ò×Âå¿ýÓïÏµ */        
  { { 'i', 's', 'l' }, 190 }, /* Icelandic  ±ùµºÓï */                      
  { { 'i', 't', 'a' }, 205 }, /* Italian  Òâ´óÀûÓï¡¢Òâ´óÀûÓï */            
//{ { 'j', 'a', 'v' }, 206 }, /* Javanese  ×¦ÍÛÓï */                      
//{ { 'j', 'b', 'o' }, 207 }, /* Lojban  Âß¼­Óï */                        
  { { 'j', 'p', 'n' }, 208 }, /* Japanese  ÈÕÓï¡¢ÈÕ±¾Óï */                
  { { 'j', 'p', 'r' }, 209 }, /* Judeo-Persian  ÓÌÌ«-²¨Ë¹Óï */             
  { { 'j', 'r', 'b' }, 210 }, /* Judeo-Arabic  ÓÌÌ«-°¢À­²®Óï */           
//{ { 'k', 'a', 'a' }, 211 }, /* Kara-Kalpak  ¿¨À­¿¨¶ûÅÁ¿ËÓï */            
//{ { 'k', 'a', 'b' }, 212 }, /* Kabyle  ¿¨²¼ÁÐÓï */                      
//{ { 'k', 'a', 'c' }, 213 }, /* Kachin  ¾°ÆÄÓï¡¢¿ËÇÕÓï */                
//{ { 'k', 'a', 'l' }, 214 }, /* Kalaallisut  ¸ñÁêÀ¼Óï */                  
//{ { 'k', 'a', 'm' }, 215 }, /* Kamba (Kenya)  ¿²°ÍÓï */                  
//{ { 'k', 'a', 'n' }, 216 }, /* Kannada  ¿¨ÄÉ´ïÓï¡¢¿µÄÉ´ïÓï */            
//{ { 'k', 'a', 'r' }, 217 }, /* Karen languages  ¿ËÂ×Óï */                
//{ { 'k', 'a', 's' }, 218 }, /* Kashmiri  ¿ËÊ²Ã×¶ûÓï¡¢¿¦Ê²Ã×¶ûÓï */      
//{ { 'k', 'a', 't' }, 154 }, /* Georgian  ¸ñÂ³¼ªÑÇÓï¡¢ÇÇÖÎÑÇÓï */        
//{ { 'k', 'a', 'u' }, 219 }, /* Kanuri  ¿¨Å¬ÀïÓï */                      
//{ { 'k', 'a', 'w' }, 220 }, /* Kawi  ¿¨ÍþÓï¡¢¹Å×¦ÍÛÓï */                
//{ { 'k', 'a', 'z' }, 221 }, /* Kazakh  ¹þÈø¿ËÓï */                      
//{ { 'k', 'b', 'd' }, 222 }, /* Kabardian  ¿¨°Í¶û´ïÓï */                  
//{ { 'k', 'h', 'a' }, 223 }, /* Khasi  ¿¨Î÷Óï */                          
//{ { 'k', 'h', 'i' }, 224 }, /* Khoisan (Other)  ¿ÆÒÀÉ£ÓïÏµ */            
//{ { 'k', 'h', 'm' }, 225 }, /* Central Khmer  ¸ßÃÞÓï¡¢ÖÐ¸ßÃÞÓï */        
//{ { 'k', 'h', 'o' }, 226 }, /* Khotanese  ºÍãÙÓï¡¢ºÍÌïÓï */              
//{ { 'k', 'i', 'k' }, 227 }, /* Kikuyu  »ù¿âÓÈÓï¡¢¼ª¿âÓÈÓï */            
//{ { 'k', 'i', 'n' }, 228 }, /* Kinyarwanda  »ùÄá°¢Íò´ïÓï¡¢Â¬Íú´ïÓï */    
//{ { 'k', 'i', 'r' }, 229 }, /* Kirghiz  ¼ª¶û¼ªË¹Óï¡¢¿Â¶û¿Ë×ÎÓï */        
//{ { 'k', 'm', 'b' }, 230 }, /* Kimbundu  ½ð±¾¶ÅÓï*/                    
//{ { 'k', 'o', 'k' }, 231 }, /* Konkani (macrolanguage)  ¿×¿¨ÄáÓï */      
//{ { 'k', 'o', 'm' }, 232 }, /* Komi  ¿ÆÃ×Óï */                          
//{ { 'k', 'o', 'n' }, 233 }, /* Kongo  ¸Õ¹ûÓï */                          
  { { 'k', 'o', 'r' }, 234 }, /* Korean  ³¯ÏÊÓï¡¢º«Óï */                  
//{ { 'k', 'o', 's' }, 235 }, /* Kosraean  ¿ÆË¹À­ÒÁÓï */                  
//{ { 'k', 'p', 'e' }, 236 }, /* Kpelle  ¿ËÅåÀÕÓï */                      
//{ { 'k', 'r', 'c' }, 237 }, /* Karachay-Balkar  ¿¨À­Ç¡ÒÁ-°Í¶û¿¨¶ûÓï*/    
//{ { 'k', 'r', 'l' }, 238 }, /* Karelian  ¿¨ÀÛÀû°¢Óï */                  
//{ { 'k', 'r', 'o' }, 239 }, /* Kru languages  ¿ËÂ³Óï */                  
//{ { 'k', 'r', 'u' }, 240 }, /* Kurukh  ¿âÂ¬¿ËÓï */                      
//{ { 'k', 'u', 'a' }, 241 }, /* Kuanyama  ¿íÑÇÂêÓï¡¢¹±Ò®ÂêÓï */          
//{ { 'k', 'u', 'm' }, 242 }, /* Kumyk  ¿âÃ·¿ËÓï */                        
//{ { 'k', 'u', 'r' }, 243 }, /* Kurdish  ¿â¶ûµÂÓï¡¢¿âµÂÓï */
//{ { 'k', 'u', 't' }, 244 }, /* Kutenai  ¿âÌØÄÚÓï */                      
//{ { 'l', 'a', 'd' }, 245 }, /* Ladino  À­µÏÅµÓï */                      
//{ { 'l', 'a', 'h' }, 246 }, /* Lahnda  À­ºà´ïÓï */                      
//{ { 'l', 'a', 'm' }, 247 }, /* Lamba  À¼°ÍÓï */                          
  { { 'l', 'a', 'o' }, 248 }, /* Lao  ÀÏÎÎÓï¡¢ÀÏÎÎÓï */                    
  { { 'l', 'a', 't' }, 249 }, /* Latin  À­¶¡Óï */                          
  { { 'l', 'a', 'v' }, 250 }, /* Latvian  À­ÍÑÎ¬ÑÇÓï */                    
//{ { 'l', 'e', 'z' }, 251 }, /* Lezghian  ÁÐ×È½ðÓï */                    
//{ { 'l', 'i', 'm' }, 252 }, /* Limburgan  ÁÖ±¤Óï */                      
//{ { 'l', 'i', 'n' }, 253 }, /* Lingala  ÁÖ¼ÓÀ­Óï¡¢ÁÖ¸ñÀ­Óï */            
  { { 'l', 'i', 't' }, 254 }, /* Lithuanian  Á¢ÌÕÍðÓï */                  
//{ { 'l', 'o', 'l' }, 255 }, /* Mongo  Ã¢¸êÓï */                          
//{ { 'l', 'o', 'z' }, 256 }, /* Lozi  ÂåÆëÓï */                          
//{ { 'l', 't', 'z' }, 257 }, /* Luxembourgish  Â¬É­±¤Óï */                
//{ { 'l', 'u', 'a' }, 258 }, /* Luba-Lulua  Â¬°Í-Â¬À­Óï */               
//{ { 'l', 'u', 'b' }, 259 }, /* Luba-Katanga  Â¬°Í-¼Óµ¤¼ÓÓï¡¢Â¬°Í¿¨µ¤¼Ó*/
//{ { 'l', 'u', 'g' }, 260 }, /* Ganda  ¸É´ïÓï¡¢Â¬¸É´ïÓï */                
//{ { 'l', 'u', 'i' }, 261 }, /* Luiseno  Â¬ÒÁÈûÅµÓï */                    
//{ { 'l', 'u', 'n' }, 262 }, /* Lunda  Â¡´ïÓï */                          
//{ { 'l', 'u', 'o' }, 263 }, /* Luo (Kenya and Tanzania)  Â¬°ÂÓï */      
//{ { 'l', 'u', 's' }, 264 }, /* Lushai  Â¬ÈøÓï */                        
//{ { 'm', 'a', 'c' }, 265 }, /* Macedonian  ÂíÆä¶ÙÓï */
//{ { 'm', 'a', 'd' }, 266 }, /* Madurese  Âí¶¼À­Óï */                    
//{ { 'm', 'a', 'g' }, 267 }, /* Magahi  Ä¦½ÒÍÓÓï¡¢Âí¼ÓºÕÓï */            
//{ { 'm', 'a', 'h' }, 268 }, /* Marshallese  ÂíÉÜ¶ûÓï */                  
//{ { 'm', 'a', 'i' }, 269 }, /* Maithili  Ã×µÂÀÕÓï¡¢ÂõµÙÀûÓï */          
//{ { 'm', 'a', 'k' }, 270 }, /* Makasar  Íû¼ÓÎýÓï */                      
//{ { 'm', 'a', 'l' }, 271 }, /* Malayalam  ÂíÀ­ÑÅÀ­Ä·Óï */                
//{ { 'm', 'a', 'n' }, 272 }, /* Mandingo  Âü¶¡¸çÓï¡¢ÂíÁÖ¿ËÓï */          
//{ { 'm', 'a', 'o' }, 273 }, /* Maori  Ã«ÀûÓï */                          
//{ { 'm', 'a', 'p' }, 274 }, /* Austronesian (Other)  ÄÏµºÓïÏµ¡¢°ÄË¹ÌØ*/ 
//{ { 'm', 'a', 'r' }, 275 }, /* Marathi  ÂíÀ­µØÓï */                      
//{ { 'm', 'a', 's' }, 276 }, /* Masai  ÂíÔúÒÁ¶ûÓï */                      
  { { 'm', 'a', 'y' }, 277 }, /* Malay (macrolanguage)  ÂíÀ´Óï */          
//{ { 'm', 'd', 'f' }, 278 }, /* Moksha  Äª¿ËÉ³Óï */                      
//{ { 'm', 'd', 'r' }, 279 }, /* Mandar  Âü´ïÓï */                        
//{ { 'm', 'e', 'n' }, 280 }, /* Mende (Sierra Leone)  ÃÅµÂÓï */
//{ { 'm', 'g', 'a' }, 281 }, /* Middle Irish (900-1200)  ÖÐ¹Å°®¶ûÀ¼Óï*/   
//{ { 'm', 'i', 'c' }, 282 }, /* Mi'kmaq  Ã×¿ËÂí¿ËÓï */                    
//{ { 'm', 'i', 'n' }, 283 }, /* Minangkabau  Ã×ÄÏ¿¨±£Óï */                
//{ { 'm', 'i', 's' }, 284 }, /* Uncoded languages  Î´±»±àÂëµÄÓïÑÔ */      
//{ { 'm', 'k', 'd' }, 265 }, /* Macedonian  ÂíÆä¶ÙÓï */                  
  { { 'm', 'k', 'h' }, 285 }, /* Mon-Khmer (Other)  ÃÏ-¸ßÃÞÓï×å */         
//{ { 'm', 'l', 'g' }, 286 }, /* Malagasy  Âí´ï¼ÓË¹¼ÓÓï¡¢ÂíÀ­¼ÓÎ÷Óï */
  { { 'm', 'l', 't' }, 287 }, /* Maltese  Âí¶úËûÓï¡¢Âí¶úËûÓï */            
//{ { 'm', 'n', 'c' }, 288 }, /* Manchu  ÂúÓï */                          
//{ { 'm', 'n', 'i' }, 289 }, /* Manipuri  ÂüÄáÆÕ¶ûÓï */                  
//{ { 'm', 'n', 'o' }, 290 }, /* Manobo languages  ÂíÅµ²©ÖîÓïÑÔ */        
//{ { 'm', 'o', 'h' }, 291 }, /* Mohawk  Äª»ô¿ËÓï */                      
//{ { 'm', 'o', 'l' }, 292 }, /* Moldavian  Ä¦¶û´ïÎ¬ÑÇÓï¡¢Ä¦¶û¶àÍßÓï */    
//{ { 'm', 'o', 'n' }, 293 }, /* Mongolian  ÃÉ¹ÅÓï */                      
//{ { 'm', 'o', 's' }, 294 }, /* Mossi  ÄªÎ÷Óï */                          
//{ { 'm', 'r', 'i' }, 273 }, /* Maori  Ã«ÀûÓï*/                          
  { { 'm', 's', 'a' }, 277 }, /* Malay (macrolanguage)  ÂíÀ´Óï */          
//{ { 'm', 'u', 'l' }, 295 }, /* Multiple languages  ¶àÖÖÓïÑÔ */          
//{ { 'm', 'u', 'n' }, 296 }, /* Munda languages  ÃÉ´ïÓï×å */              
//{ { 'm', 'u', 's' }, 297 }, /* Creek  ¿ËÀï¿ËÓï¡¢ÄÂË¹¿Æ¸ñÓï */            
//{ { 'm', 'w', 'l' }, 298 }, /* Mirandese  Ã×À¼µÂË¹Óï */                  
//{ { 'm', 'w', 'r' }, 299 }, /* Marwari  Âí¶ûÍßÀûÓï */                    
  { { 'm', 'y', 'a' }, 67  },  /* Burmese  ÃåµéÓï */                      
//{ { 'm', 'y', 'n' }, 300 }, /* Mayan languages  ÂêÑÅÓïÏµ¡¢ÂíÑÅÓïÏµ */    
//{ { 'm', 'y', 'v' }, 301 }, /* Erzya  ¶ò¶û×ÈÑÇÓï */                      
//{ { 'n', 'a', 'h' }, 302 }, /* Nahuatl languages  ÄÉÍßÌØ¶ûÓï */          
//{ { 'n', 'a', 'i' }, 303 }, /* North American Indian  ±±ÃÀÖÞÓ¡µÚ°²Öî*/   
//{ { 'n', 'a', 'p' }, 304 }, /* Neapolitan  ÄÃÆÂÀïÓï */                  
//{ { 'n', 'a', 'u' }, 305 }, /* Nauru  è§Â³Óï¡¢è§Â³Óï */                  
//{ { 'n', 'a', 'v' }, 306 }, /* Navajo  ÄÉÍß»ôÓï¡¢ÄÉÍßºÉÓï */            
//{ { 'n', 'b', 'l' }, 307 }, /* South Ndebele  ÄÏ¶÷µÂ±´ÀÕÓï */            
//{ { 'n', 'd', 'e' }, 308 }, /* North Ndebele  ±±¶÷µÂ±´ÀÕÓï */            
//{ { 'n', 'd', 'o' }, 309 }, /* Ndonga  ¶÷¶Ø¼ÓÓï¡¢¶÷¶«¼ÓÓï */
//{ { 'n', 'd', 's' }, 310 }, /* Low German  µÍµØÈö¿ËÑ·Óï */              
//{ { 'n', 'e', 'p' }, 311 }, /* Nepali  Äá²´¶ûÓï */                      
//{ { 'n', 'e', 'w' }, 312 }, /* Newari  ÄáÍß¶ûÓï */                      
//{ { 'n', 'i', 'a' }, 313 }, /* Nias  ÄáÑÇË¹Óï */                        
//{ { 'n', 'i', 'c' }, 314 }, /* Niger-Kordofanian (Other)  ÄáÈÕ¶û-¿Æ¶û    
//{ { 'n', 'i', 'u' }, 315 }, /* Niuean  Å¦°£Óï */                        
  { { 'n', 'l', 'd' }, 119 }, /* Dutch  ºÉÀ¼Óï */                          
  { { 'n', 'n', 'o' }, 316 }, /* Norwegian Nynorsk  ÐÂÅ²ÍþÓï */            
  { { 'n', 'o', 'b' }, 317 }, /* Norwegian Bokm?l  Å²Íþ²¼¿ËÄª¶ûÓï¡¢Êé*/   
//{ { 'n', 'o', 'g' }, 318 }, /* Nogai  Åµ¸ÇÓï */                          
//{ { 'n', 'o', 'n' }, 319 }, /* Old Norse  ¹ÅÅµ¶ûË¹Óï */
  { { 'n', 'o', 'r' }, 320 }, /* Norwegian  Å²ÍþÓï */                      
//{ { 'n', 'q', 'o' }, 321 }, /* N'Ko   */                                
//{ { 'n', 's', 'o' }, 322 }, /* Pedi  ±±Ë÷ÍÐÓï */                        
//{ { 'n', 'u', 'b' }, 323 }, /* Nubian languages  Å¬±ÈÑÇÓïÖ§ */
//{ { 'n', 'w', 'c' }, 324 }, /* Classical Newari  ¹ÅµäÄáÍß¶ûÓï */        
//{ { 'n', 'y', 'a' }, 325 }, /* Nyanja  ÄáÑï¼ÖÓï¡¢ÆëÇÐÍßÓï */            
//{ { 'n', 'y', 'm' }, 326 }, /* Nyamwezi  ÄáÑïÎ¤ÆëÓï */                  
//{ { 'n', 'y', 'n' }, 327 }, /* Nyankole  ÄáÑï¿ÆÀÕÓï*/                  
//{ { 'n', 'y', 'o' }, 328 }, /* Nyoro  Äá°ÂÂÞÓï */                        
//{ { 'n', 'z', 'i' }, 329 }, /* Nzima  ¶÷¼ÃÂíÓï */                        
//{ { 'o', 'c', 'i' }, 330 }, /* Occitan (post 1500)  °Â¿ËÎ÷ÌÆÓï¡¢°Â¿Ë*/   
//{ { 'o', 'j', 'i' }, 331 }, /* Ojibwa  °Â¼ª²¼ÍßÓï */                    
//{ { 'o', 'r', 'i' }, 332 }, /* Oriya  °ÂÀûÑÇÓï¡¢°ÂÀïÑÇÓï */              
//{ { 'o', 'r', 'm' }, 333 }, /* Oromo  °ÂÂÞÄªÓï */                        
//{ { 'o', 's', 'a' }, 334 }, /* Osage  °ÂÈø¸ñÓï */                        
//{ { 'o', 's', 's' }, 335 }, /* Ossetian  °ÂÈûÌÝï¡¢°ÂÈûÌáÓ?*/          
  { { 'o', 't', 'a' }, 336 }, /* Ottoman Turkish (1500-1928)  °ÂË¹Âü*/
//{ { 'o', 't', 'o' }, 337 }, /* Otomian languages  °ÂÍÐÃ×°²Óï×å */        
//{ { 'p', 'a', 'a' }, 338 }, /* Papuan (Other)  °Í²¼ÑÇÖîÓïÑÔ */          
//{ { 'p', 'a', 'g' }, 339 }, /* Pangasinan  °î°¢Î÷éªÓï */                
//{ { 'p', 'a', 'l' }, 340 }, /* Pahlavi  ²§ÂÞ²§Óï */                      
//{ { 'p', 'a', 'm' }, 341 }, /* Pampanga  °î°åÑÀÓï */                    
//{ { 'p', 'a', 'n' }, 342 }, /* Panjabi  ÅÔÕÚÆÕÓï */
//{ { 'p', 'a', 'p' }, 343 }, /* Papiamento  ÅÁÆ¤ÑÇÃÅÍÐÓï */              
//{ { 'p', 'a', 'u' }, 344 }, /* Palauan  ÅÁÀÍÓï */                        
  { { 'p', 'e', 'o' }, 345 }, /* Old Persian (ca. 600-400 B.C.)  ¹Å²¨*/   
  { { 'p', 'e', 'r' }, 135 }, /* Persian  ²¨Ë¹Óï */                        
  { { 'p', 'h', 'i' }, 346 }, /* Philippine (Other)  ·ÆÂÉ±öÖîÓïÑÔ */      
//{ { 'p', 'h', 'n' }, 347 }, /* Phoenician  ëèÄá»ùÓï */                  
//{ { 'p', 'l', 'i' }, 348 }, /* Pali  °ÍÀûÓï */                          
  { { 'p', 'o', 'l' }, 349 }, /* Polish  ²¨À¼Óï */                        
//{ { 'p', 'o', 'n' }, 350 }, /* Pohnpeian  ²¨ÄÉÅåÓï */
  { { 'p', 'o', 'r' }, 351 }, /* Portuguese  ÆÏÌÑÑÀÓï */                  
//{ { 'p', 'r', 'a' }, 352 }, /* Prakrit languages  ÆÕÀ­¿ËÀïÌØÖîÓïÑÔ */    
//{ { 'p', 'r', 'o' }, 353 }, /* Old Proven?al (to 1500)  ¹ÅÆÕÂÞÍúË¹Óï     
//{ { 'p', 'u', 's' }, 354 }, /* Pushto  ÆÕÊ²Í¼Óï¡¢ÅÁÍ¼Óï */              
//{ { 'q', 'u', 'e' }, 355 }, /* Quechua  ¿ËÇðÑÇÓï¡¢¿­³þÑÇÓï¡¢Ææ³þÍßÓï     
//{ { 'r', 'a', 'j' }, 356 }, /* Rajasthani  À­¼ÖË¹Ì¹Óï */                
//{ { 'r', 'a', 'p' }, 357 }, /* Rapanui  À­ÅÁÅ¬ÒÁÓï¡¢¸´»î½ÚµºÓï */        
//{ { 'r', 'a', 'r' }, 358 }, /* Rarotongan  À­ÂÞÌÀ¼ÓÓï */                
//{ { 'r', 'o', 'a' }, 359 }, /* Romance (Other)  ÂÞÂüÓï×å */
//{ { 'r', 'o', 'h' }, 360 }, /* Romansh  ÂÞÂüÊ²Óï */                      
//{ { 'r', 'o', 'm' }, 361 }, /* Romany  ÂÞÄ·Óï¡¢¼ªÆÕÈüÓï */
  { { 'r', 'o', 'n' }, 362 }, /* Romanian  ÂÞÂíÄáÑÇÓï */                  
  { { 'r', 'u', 'm' }, 362 }, /* Romanian  ÂÞÂíÄáÑÇÓï */                  
//{ { 'r', 'u', 'n' }, 363 }, /* Rundi  »ùÂ¡µÏÓï¡¢¿ËÂ×µØÓï */              
//{ { 'r', 'u', 'p' }, 364 }, /* Macedo Romanian  °¢ÂÞÂíÄáÑÇÓï */          
  { { 'r', 'u', 's' }, 365 }, /* Russian  ¶íÓï */                          
//{ { 's', 'a', 'd' }, 366 }, /* Sandawe  É£´ïÎ¤Óï */                      
//{ { 's', 'a', 'g' }, 367 }, /* Sango  É£¸êÓï */                          
//{ { 's', 'a', 'h' }, 368 }, /* Yakut  ÑÅ¿âÌØÓï */                        
//{ { 's', 'a', 'i' }, 369 }, /* South American Indian (Other)  ÄÏÃÀÖÞ*/   
//{ { 's', 'a', 'l' }, 370 }, /* Salishan languages  ÈøÀûÊ²ÓïÏµ */        
//{ { 's', 'a', 'm' }, 371 }, /* Samaritan Aramaic  ÈøÂíÀûÑÇ°¢À­Ã×Óï */    
//{ { 's', 'a', 'n' }, 372 }, /* Sanskrit  èóÓï */                        
//{ { 's', 'a', 's' }, 373 }, /* Sasak  ÈøÈø¿ËÓï */                        
//{ { 's', 'a', 't' }, 374 }, /* Santali  É£ËþÀûÓï */                      
  { { 's', 'c', 'c' }, 375 }, /* Serbian  Èû¶ûÎ¬ÑÇÓï */
//{ { 's', 'c', 'n' }, 376 }, /* Sicilian  Î÷Î÷ÀïÓï */                    
//{ { 's', 'c', 'o' }, 377 }, /* Scots  ËÕ¸ñÀ¼Óï */                        
//{ { 's', 'c', 'r' }, 184 }, /* Croatian  ¿ËÂÞµØÑÇÓï¡¢¿ËÂÞµØÑÇÓï */      
//{ { 's', 'e', 'l' }, 378 }, /* Selkup  Èû¶û¿âÆÕÓï */                    
//{ { 's', 'e', 'm' }, 379 }, /* Semitic (Other)  ÉÁÃ×ÌØÓï×å */            
//{ { 's', 'g', 'a' }, 380 }, /* Old Irish (to 900)  ¹Å°®¶ûÀ¼Óï */        
//{ { 's', 'g', 'n' }, 381 }, /* Sign Languages  ÊÖÓï */                  
//{ { 's', 'h', 'n' }, 382 }, /* Shan  µ§Óï */                            
//{ { 's', 'i', 'd' }, 383 }, /* Sidamo  Îý´ïÄªÓï */                      
//{ { 's', 'i', 'n' }, 384 }, /* Sinhala  É®¼ÓÂÞï¡¢ÉÙ¤ÂÞÓï */            
//{ { 's', 'i', 'o' }, 385 }, /* Siouan languages  ËÕÓïÏµ */              
//{ { 's', 'i', 't' }, 386 }, /* Sino-Tibetan (Other)  ºº²ØÓïÏµ */        
//{ { 's', 'l', 'a' }, 387 }, /* Slavic (Other)  Ë¹À­·òÓï×å */            
  { { 's', 'l', 'k' }, 388 }, /* Slovak  Ë¹Âå·¥¿ËÓï */                    
  { { 's', 'l', 'o' }, 388 }, /* Slovak  Ë¹Âå·¥¿ËÓï */                    
  { { 's', 'l', 'v' }, 389 }, /* Slovenian  Ë¹ÂåÎÄÄáÑÇÓï¡¢Ë¹ÂåÎÄÄáÑÇ*/     
//{ { 's', 'm', 'a' }, 390 }, /* Southern Sami  ÄÏÈøÃ×Óï¡¢ÄÏÈøÄªË¹Óï */    
//{ { 's', 'm', 'e' }, 391 }, /* Northern Sami  ±±ÈøÃ×Óï¡¢±±ÈøÄªË¹Óï */    
//{ { 's', 'm', 'i' }, 392 }, /* Sami languages (Other)  ÈøÃ×ÓïÖ§ */      
//{ { 's', 'm', 'j' }, 393 }, /* Lule Sami  ÂÉÀÕÅ·-ÈøÃ×Óï */               
//{ { 's', 'm', 'n' }, 394 }, /* Inari Sami  ÒÁÄÉÀï-ÈøÃ×Óï */             
//{ { 's', 'm', 'o' }, 395 }, /* Samoan  ÈøÄ¦ÑÇÓï */
//{ { 's', 'm', 's' }, 396 }, /* Skolt Sami  Ë¹¿ÆÌØ-ÈøÃ×Óï */             
//{ { 's', 'n', 'a' }, 397 }, /* Shona  ÐÞÄÉÓï¡¢ÉÜÄÉÓï*/                  
//{ { 's', 'n', 'd' }, 398 }, /* Sindhi  ÐÅµÂï¡¢ÐÁµÂÓ?*/                
//{ { 's', 'n', 'k' }, 399 }, /* Soninke  Ë÷Äþ¿ËÓï */                      
//{ { 's', 'o', 'g' }, 400 }, /* Sogdian  ËÚÌØÓï */                        
//{ { 's', 'o', 'm' }, 401 }, /* Somali  Ë÷ÂíÀïÓï¡¢Ë÷ÂíÀïÓï */            
//{ { 's', 'o', 'n' }, 402 }, /* Songhai languages  É£º£Óï */              
//{ { 's', 'o', 't' }, 403 }, /* Southern Sotho  ÄÏË÷ÍÐÓï¡¢ÄÏËóËÕÓï */    
  { { 's', 'p', 'a' }, 404 }, /* Spanish  Î÷°àÑÀÓï */                      
//{ { 's', 'q', 'i' }, 13  },  /* Albanian  °¢¶û°ÍÄáÑÇÓï */                
//{ { 's', 'r', 'd' }, 405 }, /* Sardinian  Èö¶¡Óï¡¢Èø¶¡ÄáÑÇÓï */          
//{ { 's', 'r', 'n' }, 406 }, /* Sranan Tongo  ËÕÀïÄÏÌÀ¼ÓÓï */            
  { { 's', 'r', 'p' }, 375 }, /* Serbian  Èû¶ûÎ¬ÑÇÓï */                    
//{ { 's', 'r', 'r' }, 407 }, /* Serer  ÈûÀ×¶ûÓï */                        
//{ { 's', 's', 'a' }, 408 }, /* Nilo-Saharan (Other)  ÄáÂÞ-Èö¹þÀ­ÓïÏµ*/  
//{ { 's', 's', 'w' }, 409 }, /* Swati  Ë¹ÍßÌØÓï¡¢Ë¹ÍþÊ¿À¼Óï */            
//{ { 's', 'u', 'k' }, 410 }, /* Sukuma  ËÕ¿âÂíÓï */                      
//{ { 's', 'u', 'n' }, 411 }, /* Sundanese  ÙãËûÓï */                      
//{ { 's', 'u', 's' }, 412 }, /* Susu  ËÕËÕÓï */                          
//{ { 's', 'u', 'x' }, 413 }, /* Sumerian  ËÕÃÀ¶ûÓï */                    
//{ { 's', 'w', 'a' }, 414 }, /* Swahili (macrolanguage)  Ë¹ÍßÏ£ÀïÓï*/
  { { 's', 'w', 'e' }, 415 }, /* Swedish  ÈðµäÓï */                        
//{ { 's', 'y', 'c' }, 416 }, /* Classical Syriac  ¹ÅµäÐðÀûÑÇÓï */        
//{ { 's', 'y', 'r' }, 417 }, /* Syriac  ¹ÅÐðÀûÑÇÓï */                    
//{ { 't', 'a', 'h' }, 418 }, /* Tahitian  ËþÏ£ÌáÓï¡¢´óÏªµØÓï */          
//{ { 't', 'a', 'i' }, 419 }, /* Tai (Other)  ×³¶±ÓïÏµ */                  
//{ { 't', 'a', 'm' }, 420 }, /* Tamil  Ì©Ã×¶ûÓï¡¢Ì¹Ã×¶ûÓï¡¢µ­Ã×¶ûÓï */
//{ { 't', 'a', 't' }, 421 }, /* Tatar  ËþËþ¶ûÓï¡¢÷²÷°Óï */                
//{ { 't', 'e', 'l' }, 422 }, /* Telugu  Ì©Â¬¹ÌÓï */                      
//{ { 't', 'e', 'm' }, 423 }, /* Timne  ëøÄÚÓï */                          
//{ { 't', 'e', 'r' }, 424 }, /* Tereno  ÌØÁÐÄÉÓï */                      
//{ { 't', 'e', 't' }, 425 }, /* Tetum  ÌØËþÄ·Óï¢µÂ¶ÙÓ?*/                
//{ { 't', 'g', 'k' }, 426 }, /* Tajik  Ëþ¼ª¿ËÓï */                        
//{ { 't', 'g', 'l' }, 427 }, /* Tagalog  Ëþ¼ÓÂåÓï¡¢Ëþ¼ÓÀ­Óï¡¢Ëû¼ÓÂ»Óï */  
  { { 't', 'h', 'a' }, 428 }, /* Thai  Ì©Óï */                            
  { { 't', 'i', 'b' }, 59  },  /* Tibetan  ²ØÓï */                        
//{ { 't', 'i', 'g' }, 429 }, /* Tigre  Ìá¸ñÀ×Óï */                        
//{ { 't', 'i', 'r' }, 430 }, /* Tigrinya  Ìá¸ñÀïÄáÑÇÓï¡¢Ìá¸ñÀûÄáÑÇÓï */  
//{ { 't', 'i', 'v' }, 431 }, /* Tiv  µÙ·òÓï */                            
//{ { 't', 'k', 'l' }, 432 }, /* Tokelau  ÍÐ¿ËÀÍÓï */
//{ { 't', 'l', 'h' }, 433 }, /* Klingon  ¿ËÁÖ¹±Óï */                      
//{ { 't', 'l', 'i' }, 434 }, /* Tlingit  ÌØÁÖ¼ªÌØÓï */                    
//{ { 't', 'm', 'h' }, 435 }, /* Tamashek  ËþÂíÉá¿ËÓï */                  
//{ { 't', 'o', 'g' }, 436 }, /* Tonga (Nyasa)  ÌÀ¼ÓÓï (ÄáÑÇÈø) */         
//{ { 't', 'o', 'n' }, 437 }, /* Tonga (Tonga Islands)  ÌÀ¼ÓÓï (ÌÀ¼Óµº)*/  
//{ { 't', 'p', 'i' }, 438 }, /* Tok Pisin  ÍÐ¿ËÆ¤ÐÁÓï¡¢°Í²¼ÑÇÆ¤ÇÕÓï */    
//{ { 't', 's', 'i' }, 439 }, /* Tsimshian  ÇÕÎ÷°²Óï */                    
//{ { 't', 's', 'n' }, 440 }, /* Tswana  ´ÄÍßÄÉÓï */                      
//{ { 't', 's', 'o' }, 441 }, /* Tsonga  ´Ï¼ÓÓï¡¢×Ú¼ÓÓï */                
//{ { 't', 'u', 'k' }, 442 }, /* Turkmen  ÍÁ¿âÂüÓï */                      
//{ { 't', 'u', 'm' }, 443 }, /* Tumbuka  ÆæÍ¼Ä·²¼¿¨Óï */
//{ { 't', 'u', 'p' }, 444 }, /* Tupi languages  Í¼Æ¤ÓïÏµ */              
  { { 't', 'u', 'r' }, 445 }, /* Turkish  ÍÁ¶úÆäÓï */                      
//{ { 't', 'u', 't' }, 446 }, /* Altaic (Other)  °¢¶ûÌ©ÓïÏµ */            
//{ { 't', 'v', 'l' }, 447 }, /* Tuvalu  Í¼ÍßÂ¬Óï */                      
//{ { 't', 'w', 'i' }, 448 }, /* Twi  ÆõÎ¬Óï¡¢ÌØÍþÓï¡¢¶àÍþÓï */            
//{ { 't', 'y', 'v' }, 449 }, /* Tuvinian  Í¼ÍßÓï¡¢Í¼ØôÓï */              
//{ { 'u', 'd', 'm' }, 450 }, /* Udmurt  ÎÚµÂÄÂ¶ûÌØÓï */                  
//{ { 'u', 'g', 'a' }, 451 }, /* Ugaritic  ÎÚ¼ÓÀïÌØÓï */                  
  { { 'u', 'i', 'g' }, 452 }, /* Uighur  Î¬Îá¶ûÓï */                      
  { { 'u', 'k', 'r' }, 453 }, /* Ukrainian  ÎÚ¿ËÀ¼Óï */                    
//{ { 'u', 'm', 'b' }, 454 }, /* Umbundu  ÎÌ±¾¶ÅÓï */                      
//{ { 'u', 'n', 'd' }, 455 }, /* Undetermined  Î´È·¶¨µÄÓïÑÔ */            
//{ { 'u', 'r', 'd' }, 456 }, /* Urdu  ÎÚ¶û¶¼Óï¡¢ÎÚ¶¼Óï¡¢ÎîÂ³¶¼Óï */      
//{ { 'u', 'z', 'b' }, 457 }, /* Uzbek  ÎÚ×È±ð¿ËÓï¡¢ÎÚ×Î±ð¿ËÓï */          
//{ { 'v', 'a', 'i' }, 458 }, /* Vai  ÍßÒÁÓï */                            
//{ { 'v', 'e', 'n' }, 459 }, /* Venda  ÎÄ´ïÓï¡¢ÎÂ´ïÓï */                  
  { { 'v', 'i', 'e' }, 460 }, /* Vietnamese  Ô½ÄÏÓï¡¢¾©Óï */              
//{ { 'v', 'o', 'l' }, 461 }, /* Volap¨¹k  ÎÖÀ­ÆÕ¿ËÓï */                  
//{ { 'v', 'o', 't' }, 462 }, /* Votic  ÎÖÌá¿ËÓï */                        
//{ { 'w', 'a', 'k' }, 463 }, /* Wakashan languages  Íß¿¨Ê²ÓïÏµ */        
//{ { 'w', 'a', 'l' }, 464 }, /* Wolaytta   */                            
//{ { 'w', 'a', 'r' }, 465 }, /* Waray (Philippines)  ÍßÀµÓï */            
//{ { 'w', 'a', 's' }, 466 }, /* Washo  ÍßÐ¤Óï */                          
//{ { 'w', 'e', 'l' }, 103 }, /* Welsh  Íþ¶ûÊ¿Óï¡¢Íþ¶ûÊ¿Óï */              
//{ { 'w', 'e', 'n' }, 467 }, /* Sorbian languages  Ë÷²¼ÖîÓïÑÔ */          
//{ { 'w', 'l', 'n' }, 468 }, /* Walloon  ÍßÁúÓï¡¢ÍßÂ¡Óï¡¢»ªÂ¡Óï */        
//{ { 'w', 'o', 'l' }, 469 }, /* Wolof  ÎÖÂå·òÓï¡¢ä×Â³·òÓï */              
//{ { 'x', 'a', 'l' }, 470 }, /* Kalmyk  ¿¨¶ûÃ·¿ËÓï¡¢ÎÀÀ­ÌØÓï */          
//{ { 'x', 'h', 'o' }, 471 }, /* Xhosa  ¿ÆÈøÓï */                          
//{ { 'y', 'a', 'o' }, 472 }, /* Yao  ÑþÓï (ÂíÀ­Î¬) */                     
//{ { 'y', 'a', 'p' }, 473 }, /* Yapese  ÑÅÆÖÓï */                        
//{ { 'y', 'i', 'd' }, 474 }, /* Yiddish  ÒÀµØÓï¡¢ÒâµÚÐ÷Óï */              
//{ { 'y', 'o', 'r' }, 475 }, /* Yoruba  Ô¼Â³°ÍÓï */                      
//{ { 'y', 'p', 'k' }, 476 }, /* Yupik languages  ÓÈÆ¤¿ËÓïÏµ */            
//{ { 'z', 'a', 'p' }, 477 }, /* Zapotec  Èø²¨ÌØ¿ËÓï */                    
//{ { 'z', 'b', 'l' }, 478 }, /* Blissymbols  ²¼ÀûË¹·ûºÅ */                
//{ { 'z', 'e', 'n' }, 479 }, /* Zenaga  ÕÜÄÉ¼ÓÓï */                      
//{ { 'z', 'h', 'a' }, 480 }, /* Zhuang  ×³Óï */                          
  { { 'z', 'h', 'o' }, 81  },  /* Chinese  ÖÐÎÄ¡¢ººÓï */                  
//{ { 'z', 'n', 'd' }, 481 }, /* Zande languages  ÔÞµÂÖîÓïÑÔ */            
//{ { 'z', 'u', 'l' }, 482 }, /* Zulu  ×æÂ³Óï */                          
//{ { 'z', 'u', 'n' }, 483 }, /* Zuni  ×æÄáÓï */                          
//{ { 'z', 'x', 'x' }, 484 }, /* No linguistic content  Ã»ÓÐÓïÑÔÄÚÈÝ */    
};

#define ISO_639_2_SUPPROT_MAX_DESC_CNT  \
  ((sizeof(iso_639_2_desc))/(sizeof(iso_639_2_desc_t)))

#define ISO_639_2_UNDEFINED_DESC       0x0

#define SWAP_BYTE_ORDER(x)             ((x >> 16) \
                                       | (x & 0x0000FF00) \
                                       | ((x & 0xFF) << 16))

static int compare_desc(const void *p_desc1, const void *p_desc2)
{
  return memcmp(p_desc1, p_desc2, ISO_639_2_DESC_LENGTH);
}

u16 iso_639_2_desc_to_idx(const char *p_desc)
{
  char *p_found = NULL;
  char *p_head = (char *)(iso_639_2_desc);

  CHECK_FAIL_RET((ISO_639_2_SUPPROT_MAX_DESC_CNT < 255), ISO_639_2_UNDEFINED_DESC);
  
  p_found = lib_bsearch(p_desc, 
                        iso_639_2_desc, 
                        ISO_639_2_SUPPROT_MAX_DESC_CNT, 
                        sizeof(iso_639_2_desc_t), 
                        compare_desc);
  if (p_found == NULL)
  {
    return ISO_639_2_UNDEFINED_DESC;
  }

  return (p_found - p_head)  / sizeof(iso_639_2_desc_t);
}

const char * iso_639_2_idx_to_desc(u16 idx)
{
  CHECK_FAIL_RET((ISO_639_2_SUPPROT_MAX_DESC_CNT < 255), ((char *)iso_639_2_desc[ISO_639_2_UNDEFINED_DESC].desc));
  
  if (idx >= ISO_639_2_SUPPROT_MAX_DESC_CNT
    || idx == ISO_639_2_UNDEFINED_DESC)
  {
    return (char *)iso_639_2_desc[ISO_639_2_UNDEFINED_DESC].desc;
  }

  return (char *)iso_639_2_desc[idx].desc;
}

u16 iso_639_2_idx_to_type(u16 idx)
{
  return iso_639_2_desc[idx].index;
}

